<a href="https://colab.research.google.com/github/jleacock2020/CourseraDataAnalystWork/blob/main/Movies%20SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import sqlite3
conn = sqlite3.connect('Moviess.db')

In [ ]:
# cursor object
cursor_obj = conn.cursor()

In [ ]:
statement = '''SELECT * FROM Movies'''
cursor_obj.execute(statement)

In [ ]:
print("All the data")
output_all = cursor_obj.fetchall()
print(output_all)

All the data
[(901, 'Vertigo', 1958, 128, 'English', '1958-08-24', 'UK', 'Righty Sock', 9001, '8.4', '263575', None, None, None, None, None), (902, 'The Innocents', 1961, 100, 'English', '1962-02-19', 'SW', 'Jack Malvern', 9002, '7.9', '20207', None, None, None, None, None), (903, 'Lawrence of Arabia', 1962, 216, 'English', '1962-12-11', 'UK', 'Flagrant Baronessa', 9003, '8.3', '202778', None, None, None, None, None), (904, 'The Deer Hunter', 1978, 183, 'English', '1979-03-08', 'UK', 'Alec Shaw', 9005, '8.2', '484746', None, None, None, None, None), (905, 'Amadeus', 1984, 160, 'English', '1985-01-07', 'UK', 'Francois Truffaut', 9006, '7.3', None, None, None, None, None, None), (906, 'Blade Runner', 1982, 117, 'English', '1982-09-09', 'UK', 'Victor Woeltjen', 9007, '8.6', '779489', None, None, None, None, None), (907, 'Eyes Wide Shut', 1999, 159, 'English', None, 'UK', 'Simon Wright', 9008, None, '227235', None, None, None, None, None), (908, 'The Usual Suspects', 1995, 106, 'English', '1995-08-25', 'UK', 'Neal Wruck', 9009, '3', '195961', None, None, None, None, None), (909, 'Chinatown', 1974, 130, 'English', '1974-08-09', 'UK', 'Paul Monks', 9010, '8.1', '203875', None, None, None, None, None), (910, 'Boogie Nights', 1997, 155, 'English', '1998-02-16', 'UK', 'Mike Salvati', 9011, '8.4', None, None, None, None, None, None), (911, 'Annie Hall', 1977, 93, 'English', '1977-04-20', 'USA', 'Armond White', 9013, '7', '862618', None, None, None, None, None), (912, 'Princess Mononoke', 1997, 134, 'Japanese', '2001-10-19', 'UK', 'Wesley S. Walker', 9001, '7.7', '830095', None, None, None, None, None), (913, 'The Shawshank Redemption', 1994, 142, 'English', '1995-02-17', 'UK', 'Sasha Goldshtein', 9014, '4', '642132', None, None, None, None, None), (914, 'American Beauty', 1999, 122, 'English', None, 'UK', 'Josh Cates', 9015, '7.7', '81328', None, None, None, None, None), (915, 'Titanic', 1997, 194, 'English', '1998-01-23', 'UK', 'Krug Stillo', 9016, None, '580301', None, None, None, None, None), (916, 'Good Will Hunting', 1997, 126, 'English', '1998-06-03', 'UK', 'Scott LeBrun', 9017, '8.1', '609451', None, None, None, None, None), (917, 'Deliverance', 1972, 109, 'English', '1982-10-05', 'UK', 'Hannah Steele', 9018, '8', '667758', None, None, None, None, None), (918, 'Trainspotting', 1996, 94, 'English', '1996-02-23', 'UK', 'Vincent Cadena', 9019, '8.4', '511613', None, None, None, None, None), (919, 'The Prestige', 2006, 130, 'English', '2006-11-10', 'UK', 'Brandt Sponseller', 9020, '6.7', '13091', None, None, None, None, None), (920, 'Donnie Darko', 2001, 113, 'English', None, 'UK', 'Richard Adams', 9021, '7.0', '544452', None, None, None, None, None), (921, 'Slumdog Millionaire', 2008, 120, 'English', '2009-01-09', 'UK', 'Andre Bazin', 9022, '7.0', '557054', None, None, None, None, None), (922, 'Aliens', 1986, 137, 'English', '1986-08-29', 'UK', 'Judith Christ', 9023, '7.0', '569657', None, None, None, None, None), (923, 'Beyond the Sea', 2004, 118, 'English', '2004-11-26', 'UK', 'Peter Travers', 9024, '6.9', '582260', None, None, None, None, None), (924, 'Avatar', 2009, 162, 'English', '2009-12-17', 'UK', 'Roger Ebert', 9025, '6.9', '594862', None, None, None, None, None), (926, 'Seven Samurai', 1954, 207, 'Japanese', '1954-04-26', 'JP', 'Pauline Kael', 9026, '6.9', '607465', None, None, None, None, None), (927, 'Spirited Away', 2001, 125, 'Japanese', '2003-09-12', 'UK', 'Leonard Martin', 9027, '6.8', '620067', None, None, None, None, None), (928, 'Back to the Future', 1985, 116, 'English', '1985-12-04', 'UK', 'Andrew Sarris', 9028, '6.8', '632670', None, None, None, None, None), (925, 'Braveheart', 1995, 178, 'English', '1995-09-08', 'UK', 'Gene Shalit', 9029, '6.8', '645273', None, None, None, None, None)]

In [ ]:
for i in output_all:
  print(i)

(901, 'Vertigo', 1958, 128, 'English', '1958-08-24', 'UK', 'Righty Sock', 9001, '8.4', '263575', None, None, None, None, None)
(902, 'The Innocents', 1961, 100, 'English', '1962-02-19', 'SW', 'Jack Malvern', 9002, '7.9', '20207', None, None, None, None, None)
(903, 'Lawrence of Arabia', 1962, 216, 'English', '1962-12-11', 'UK', 'Flagrant Baronessa', 9003, '8.3', '202778', None, None, None, None, None)
(904, 'The Deer Hunter', 1978, 183, 'English', '1979-03-08', 'UK', 'Alec Shaw', 9005, '8.2', '484746', None, None, None, None, None)
(905, 'Amadeus', 1984, 160, 'English', '1985-01-07', 'UK', 'Francois Truffaut', 9006, '7.3', None, None, None, None, None, None)
(906, 'Blade Runner', 1982, 117, 'English', '1982-09-09', 'UK', 'Victor Woeltjen', 9007, '8.6', '779489', None, None, None, None, None)
(907, 'Eyes Wide Shut', 1999, 159, 'English', None, 'UK', 'Simon Wright', 9008, None, '227235', None, None, None, None, None)
(908, 'The Usual Suspects', 1995, 106, 'English', '1995-08-25', 'UK', 'Neal Wruck', 9009, '3', '195961', None, None, None, None, None)
(909, 'Chinatown', 1974, 130, 'English', '1974-08-09', 'UK', 'Paul Monks', 9010, '8.1', '203875', None, None, None, None, None)
(910, 'Boogie Nights', 1997, 155, 'English', '1998-02-16', 'UK', 'Mike Salvati', 9011, '8.4', None, None, None, None, None, None)
(911, 'Annie Hall', 1977, 93, 'English', '1977-04-20', 'USA', 'Armond White', 9013, '7', '862618', None, None, None, None, None)
(912, 'Princess Mononoke', 1997, 134, 'Japanese', '2001-10-19', 'UK', 'Wesley S. Walker', 9001, '7.7', '830095', None, None, None, None, None)
(913, 'The Shawshank Redemption', 1994, 142, 'English', '1995-02-17', 'UK', 'Sasha Goldshtein', 9014, '4', '642132', None, None, None, None, None)
(914, 'American Beauty', 1999, 122, 'English', None, 'UK', 'Josh Cates', 9015, '7.7', '81328', None, None, None, None, None)
(915, 'Titanic', 1997, 194, 'English', '1998-01-23', 'UK', 'Krug Stillo', 9016, None, '580301', None, None, None, None, None)
(916, 'Good Will Hunting', 1997, 126, 'English', '1998-06-03', 'UK', 'Scott LeBrun', 9017, '8.1', '609451', None, None, None, None, None)
(917, 'Deliverance', 1972, 109, 'English', '1982-10-05', 'UK', 'Hannah Steele', 9018, '8', '667758', None, None, None, None, None)
(918, 'Trainspotting', 1996, 94, 'English', '1996-02-23', 'UK', 'Vincent Cadena', 9019, '8.4', '511613', None, None, None, None, None)
(919, 'The Prestige', 2006, 130, 'English', '2006-11-10', 'UK', 'Brandt Sponseller', 9020, '6.7', '13091', None, None, None, None, None)
(920, 'Donnie Darko', 2001, 113, 'English', None, 'UK', 'Richard Adams', 9021, '7.0', '544452', None, None, None, None, None)
(921, 'Slumdog Millionaire', 2008, 120, 'English', '2009-01-09', 'UK', 'Andre Bazin', 9022, '7.0', '557054', None, None, None, None, None)
(922, 'Aliens', 1986, 137, 'English', '1986-08-29', 'UK', 'Judith Christ', 9023, '7.0', '569657', None, None, None, None, None)
(923, 'Beyond the Sea', 2004, 118, 'English', '2004-11-26', 'UK', 'Peter Travers', 9024, '6.9', '582260', None, None, None, None, None)
(924, 'Avatar', 2009, 162, 'English', '2009-12-17', 'UK', 'Roger Ebert', 9025, '6.9', '594862', None, None, None, None, None)
(926, 'Seven Samurai', 1954, 207, 'Japanese', '1954-04-26', 'JP', 'Pauline Kael', 9026, '6.9', '607465', None, None, None, None, None)
(927, 'Spirited Away', 2001, 125, 'Japanese', '2003-09-12', 'UK', 'Leonard Martin', 9027, '6.8', '620067', None, None, None, None, None)
(928, 'Back to the Future', 1985, 116, 'English', '1985-12-04', 'UK', 'Andrew Sarris', 9028, '6.8', '632670', None, None, None, None, None)
(925, 'Braveheart', 1995, 178, 'English', '1995-09-08', 'UK', 'Gene Shalit', 9029, '6.8', '645273', None, None, None, None, None)

In [ ]:
## Fetch few rows from the table
statement = '''SELECT * FROM Movies'''
cursor_obj.execute(statement)

print("All the data")
# If you want to fetch few rows from the table we use fetchmany(numberofrows) and mention the number how many rows you want to fetch
output_many = cursor_obj.fetchmany(2)
for row_many in output_many:
  print(row_many)

All the data
(901, 'Vertigo', 1958, 128, 'English', '1958-08-24', 'UK', 'Righty Sock', 9001, '8.4', '263575', None, None, None, None, None)
(902, 'The Innocents', 1961, 100, 'English', '1962-02-19', 'SW', 'Jack Malvern', 9002, '7.9', '20207', None, None, None, None, None)

In [ ]:
# Fetch only mov_id from the table
statement = '''SELECT mov_id FROM movies'''
cursor_obj.execute(statement)

print("All the data")
output_column = cursor_obj.fetchall()
for fetch in output_column:
  print(fetch)

All the data
(901,)
(902,)
(903,)
(904,)
(905,)
(906,)
(907,)
(908,)
(909,)
(910,)
(911,)
(912,)
(913,)
(914,)
(915,)
(916,)
(917,)
(918,)
(919,)
(920,)
(921,)
(922,)
(923,)
(924,)
(926,)
(927,)
(928,)
(925,)

In [ ]:
query_update='''update movies set mov_lang='Hindi' where mov_name="Vertigo"'''
cursor_obj.execute(query_update)

In [ ]:
statement = '''SELECT * FROM Movies'''
cursor_obj.execute(statement)

print("All the data")
output1 = cursor_obj.fetchmany(2)
for row in output1:
  print(row)

All the data
(901, 'Vertigo', 1958, 128, 'Hindi', '1958-08-24', 'UK', 'Righty Sock', 9001, '8.4', '263575', None, None, None, None, None)
(902, 'The Innocents', 1961, 100, 'English', '1962-02-19', 'SW', 'Jack Malvern', 9002, '7.9', '20207', None, None, None, None, None)

In [ ]:
import pandas as pd
#retrieve the query results into a pandas dataframe
df = pd.read_sql_query("select * from movies;", conn)

#print the dataframe
df.head()

,mov_id,mov_name,mov_year,mov_time,mov_lang,mov_dt_rel,mov_rel_country,rev_name,rev_id,rev_stars,num_o_ratings,field12,field13,field14,field15,field16
0,901,Vertigo,1958,128,Hindi,1958-08-24,UK,Righty Sock,9001,8.4,263575,None,None,None,None,None
1,902,The Innocents,1961,100,English,1962-02-19,SW,Jack Malvern,9002,7.9,20207,None,None,None,None,None
2,903,Lawrence of Arabia,1962,216,English,1962-12-11,UK,Flagrant Baronessa,9003,8.3,202778,None,None,None,None,None
3,904,The Deer Hunter,1978,183,English,1979-03-08,UK,Alec Shaw,9005,8.2,484746,None,None,None,None,None
4,905,Amadeus,1984,160,English,1985-01-07,UK,Francois Truffaut,9006,7.3,None,None,None,None,None,None

In [ ]:
df[df['mov_year']==1962]

,mov_id,mov_name,mov_year,mov_time,mov_lang,mov_dt_rel,mov_rel_country,rev_name,rev_id,rev_stars,num_o_ratings,field12,field13,field14,field15,field16
2,903,Lawrence of Arabia,1962,216,English,1962-12-11,UK,Flagrant Baronessa,9003,8.3,202778,None,None,None,None,None

In [ ]:
# Drop the table if already exists.
cursor_obj.execute("DROP TABLE IF EXISTS INSTRUCTOR")

In [ ]:
# Creating table
table = """ create table IF NOT EXISTS INSTRUCTOR2(ID INTEGER PRIMARY KEY , FNAME TEXT NOT NULL, LNAME TEXT, CITY TEXT, CCODE TEXT);"""

cursor_obj.execute(table)

print("Table is Ready")

Table is Ready

PRIMARY KEY

NOT NULL

UNIQUE

CHECK

FORIEGN KEY

In [ ]:
cursor_obj.execute('''insert into INSTRUCTOR2 values (4,"Ravi" , 'Ahuja', 'TORONTO', 'CA')''')

In [ ]:
cursor_obj.execute('''insert into INSTRUCTOR values (2, 'Raul', 'Chong', 'Markham', 'CA'), (3, 'Hima', 'Vasudevan', 'Chicago', 'US')''')

In [ ]:
statement = '''SELECT * FROM INSTRUCTOR'''
cursor_obj.execute(statement)

print("All the data")
output_all = cursor_obj.fetchall()
for row_all in output_all:
  print(row_all)

All the data
(1, 'Rav', 'Ahuja', 'TORONTO', 'CA')
(2, 'Raul', 'Chong', 'Markham', 'CA')
(3, 'Hima', 'Vasudevan', 'Chicago', 'US')

In [ ]:
# Close the connection
conn.close()